app/views/comments/_comment.html.erb

INSERT INTO "comments" ("comment", "confidence", "created_at", "markeddown_comment", "short_id", "story_id", "thread_id", "updated_at", "upvotes") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"
---
        <% end %>
        <%= time_ago_in_words_label((comment.has_been_edited? ?
          comment.updated_at : comment.created_at), :strip_about => true) %> ago