app/views/users/tree.html.erb

  Newest users:
  <%= raw @newest.map{|u| "<a class=\"new_user\"> Anonymous</a> " <<
---
SELECT "users".* FROM "users"   ORDER BY id DESC