app/views/stories/_listdetail.html.erb

SELECT "taggings".* FROM "taggings"  WHERE "taggings"."story_id" IN (10, 9, 6, 5, 1, 4, 3, 2)
SELECT "tags".* FROM "tags"  WHERE 1=0
---
      <span class="tags">
        <% story.sorted_taggings.each do |tagging| %>