app/controllers/comments_controller.rb

SELECT  "stories".* FROM "stories"  WHERE "stories"."short_id" = 'kwk9nx'  ORDER BY "stories"."id" ASC LIMIT 1
SELECT  "comments".* FROM "comments"  WHERE "comments"."story_id" = 2 AND "comments"."short_id" = 'cygbgm'  ORDER BY "comments"."id" ASC LIMIT 1
SELECT  "comments".* FROM "comments"  WHERE "comments"."story_id" = 2 AND "comments"."user_id" = '127.0.0.1' AND "comments"."parent_comment_id" IS NULL  ORDER BY "comments"."id" ASC LIMIT 1
SELECT  1 AS one FROM "comments"  WHERE "comments"."short_id" = 'mucwqk' LIMIT 1
INSERT INTO "comments" ("comment", "confidence", "created_at", "markeddown_comment", "parent_comment_id", "short_id", "story_id", "thread_id", "updated_at", "upvotes") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"
---
  def create
    if !(story = Story.where(:short_id => params[:story_id]).first) ||
    story.is_gone?
      return render :text => "can't find story", :status => 400
    end

    comment = story.comments.build
    comment.comment = params[:comment].to_s
    #comment.user = @user

    if params[:hat_id] && @user.hats.where(:id => params[:hat_id])
      comment.hat_id = params[:hat_id]
    end

    if params[:parent_comment_short_id].present?
      if pc = Comment.where(:story_id => story.id, :short_id =>
      params[:parent_comment_short_id]).first
        comment.parent_comment = pc
      else
        return render :json => { :error => "invalid parent comment",
          :status => 400 }
      end
    end

    # prevent double-clicks of the post button
    if @anon && params[:preview].blank? &&
      (pc = Comment.where(:story_id => story.id, :user_id => @anon[:ip],
        :parent_comment_id => comment.parent_comment_id).first)
      if (Time.now - pc.created_at) < 5.minutes

SELECT  "comments".* FROM "comments"  WHERE "comments"."short_id" = 'wex5ps'  ORDER BY "comments"."id" ASC LIMIT 1
SELECT  "votes".* FROM "votes"  WHERE "votes"."user_id" IS NULL AND "votes"."story_id" = 2 AND "votes"."comment_id" = 39  ORDER BY "votes"."id" ASC LIMIT 1
---
  def find_comment
    comment = Comment.where(:short_id => params[:id]).first
    if @user && comment
      comment.current_vote = Vote.where(:user_id => @user.id,
        :story_id => comment.story_id, :comment_id => comment.id).first