app/controllers/stories_controller.rb

  def create
    @title = "Submit Story"
    @cur_url = "/stories/new"

    @story = Story.new(story_params)
    if @user
      @story.user_id = @user.id
    elsif @anon
      @story.anon = true
    end

    if @story.valid? && !(@story.already_posted_story && !@story.seen_previous)
      if @story.save
---
INSERT INTO "stories" ("anon", "created_at", "description", "hotness", "markeddown_description", "short_id", "title", "upvotes", "url", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def destroy
    if !@story.is_editable_by_user?(@user)
      flash[:error] = "You cannot edit that story."
      return redirect_to "/"
    end

    @story.is_expired = true
    @story.editor = @user

    if params[:reason].present? && @story.user_id != @user.id
      @story.moderation_reason = params[:reason]
    end

    @story.save(:validate => false)
---
INSERT INTO "moderations" ("action", "created_at", "moderator_user_id", "reason", "story_id", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["action", "deleted story"], ["created_at", "2015-09-29 01:25:33.446188"], ["moderator_user_id", 1], ["reason", "sdf"], ["story_id", 4], ["updated_at", "2015-09-29 01:25:33.446188"]]
UPDATE "stories" SET "is_expired" = $1, "is_moderated" = $2 WHERE "stories"."id" = 4  [["is_expired", 1], ["is_moderated", 1]]

  def show
    @story = Story.where(:short_id => params[:id]).first!

    if @story.merged_into_story
      flash[:success] = "\"#{@story.title}\" has been merged into this story."
      return redirect_to @story.merged_into_story.comments_path
    end

    if @story.can_be_seen_by_user?(@user)
      @title = @story.title
    else
      @title = "[Story removed]"
    end

    @short_url = @story.short_id_url

    @comments = @story.merged_comments.includes(:user, :story,
      :hat).arrange_for_user(@user)
---
SELECT  "stories".* FROM "stories"  WHERE "stories"."short_id" = 'kwk9nx'  ORDER BY "stories"."id" ASC LIMIT 1
SELECT  "users".* FROM "users"  WHERE "users"."id" = $1 LIMIT 1  [["id", 1]]
SELECT "comments".* FROM "comments"  WHERE "comments"."story_id" IN (2)  ORDER BY confidence DESC
SELECT "stories".* FROM "stories"  WHERE "stories"."id" IN (2)

  def find_story
    story = Story.where(:short_id => params[:story_id]).first
    if @user && story
      story.vote = Vote.where(:user_id => @user.id,
        :story_id => story.id, :comment_id => nil).first.try(:vote)
---
SELECT  "stories".* FROM "stories"  WHERE "stories"."short_id" = 'sqwhla'  ORDER BY "stories"."id" ASC LIMIT 1
SELECT  "votes".* FROM "votes"  WHERE "votes"."user_id" IS NULL AND "votes"."story_id" = 13 AND "votes"."comment_id" IS NULL  ORDER BY "votes"."id" ASC LIMIT 1

  def find_user_story
    if @user.is_moderator?
      @story = Story.where(:short_id => params[:story_id] || params[:id]).first
---
SELECT  "stories".* FROM "stories"  WHERE "stories"."id" = $1 LIMIT 1  [["id", 4]]